In [1]:
import pandas as pd

In [2]:
var = pd.DataFrame({
     "Name": ["a","b","a","b","a","b","c","d","c","d"],
      "S1" : [12,13,14,12,13,14,12,13,14,12],
      "S2" : [23,24,25,23,24,25,23,24,25,23]
})
var

  Name  S1  S2
0    a  12  23
1    b  13  24
2    a  14  25
3    b  12  23
4    a  13  24
5    b  14  25
6    c  12  23
7    d  13  24
8    c  14  25
9    d  12  23

In [3]:
var_new  = var.groupby("Name")

In [4]:
var_new

In [8]:
for x,y in var_new:
    print(x)
    print(y)
    print()

a
  Name  S1  S2
0    a  12  23
2    a  14  25
4    a  13  24

b
  Name  S1  S2
1    b  13  24
3    b  12  23
5    b  14  25

c
  Name  S1  S2
6    c  12  23
8    c  14  25

d
  Name  S1  S2
7    d  13  24
9    d  12  23

In [11]:
var_new.get_group("a")

  Name  S1  S2
0    a  12  23
2    a  14  25
4    a  13  24

In [14]:
var_new.get_group("b")

  Name  S1  S2
1    b  13  24
3    b  12  23
5    b  14  25

In [15]:
var_new.get_group("c")

  Name  S1  S2
6    c  12  23
8    c  14  25

In [16]:
var_new.get_group("d")

  Name  S1  S2
7    d  13  24
9    d  12  23

In [12]:
var_new.min()

      S1  S2
Name
a     12  23
b     12  23
c     12  23
d     12  23

In [13]:
var_new.max()

      S1  S2
Name
a     14  25
b     14  25
c     14  25
d     13  24